#include <stdio.h>//Підключаємо необхідну бібліотеку

int main() {
    int n;//оголошуємо зміну
    printf("Введіть кількість чисел: ");//Вводимо інформацію з клавіатури 
    scanf_s("%d", &n);

    FILE* file;
    if (fopen_s(&file, "додатні_числа.txt", "w") != 0) {//створюємо файл...
        printf("Помилка відкриття файлу.");//Помилка у випадку якщо з файлом щось не так
        return 1;
    }

    int number = 2;//Записуємо парні числа опираючись на вхідні данні
    for (int i = 0; i < n; i++) {
        fprintf(file, "%d\n", number);
        number += 2;
    }

    fclose(file);
    printf("Файл успішно створений та заповнений додатніми числами.\n");//Виводимо інформацію на екран юзера що все добре спрацювало...

    return 0;//Кінець програми
}


